In [1]:
import numpy as np
import pandas as pd
import pywt

In [97]:
df = pd.read_csv('Ejemplos/Distribuciones/Binomial-fin.csv',index_col='indice')

In [265]:
mult = pd.read_csv('Ejemplos/MULTIVARIABLE/ARMA-TEND-PER-fin.csv',index_col='indice')

In [3]:
def series_periodos(inicio, periodos, freq): 
    serie = pd.date_range(start=inicio, periods=periodos, freq=freq)
    return serie

DESPLAZAMIENTO TEMPORAL Y TRASLACION

In [4]:
def time_shift(series, shift):
    return series.shift(shift)

In [5]:
def traslacion(df,shift):
    for x in df.columns:
        df[x] = df[x] + shift
    return df

In [11]:
df

            Valor
indice
2014-01-31     53
2014-02-28     52
2014-03-31     51
2014-04-30     52
2014-05-31     50
...           ...
2023-08-31     51
2023-09-30     50
2023-10-31     50
2023-11-30     51
2023-12-31     51

[120 rows x 1 columns]

In [12]:
traslacion(df,10)

            Valor
indice
2014-01-31     63
2014-02-28     62
2014-03-31     61
2014-04-30     62
2014-05-31     60
...           ...
2023-08-31     61
2023-09-30     60
2023-10-31     60
2023-11-30     61
2023-12-31     61

[120 rows x 1 columns]

In [186]:
mult

            Altura     Dinero       Peso
indice
2014-01-31     NaN  97.156595  86.151051
2014-02-28     NaN  86.663780  79.241386
2014-03-31     NaN  68.603793  84.825309
2014-04-30     NaN  58.224646  83.053743
2014-05-31     NaN  48.634793  84.147756
...            ...        ...        ...
2023-08-31     NaN   7.036005  82.496740
2023-09-30     NaN   7.024714  85.493784
2023-10-31     NaN   7.136102  84.031223
2023-11-30     NaN   6.781243  83.746984
2023-12-31     NaN   7.043206  82.227556

[120 rows x 3 columns]

In [181]:
traslacion(mult,10)

                Altura      Dinero        Peso
indice
2014-01-31   80.555312  139.091399  122.902687
2014-02-28   78.346558  123.850549  112.844928
2014-03-31   80.871320   97.866499  121.120237
2014-04-30   79.665688   83.274410  118.697997
2014-05-31   97.544611   69.460597  120.748102
...                ...         ...         ...
2023-08-31  103.631116   10.000000  118.131639
2023-09-30  102.122000   10.000000  122.406146
2023-10-31  101.822198   10.000000  119.946900
2023-11-30  102.320897   10.000000  119.452335
2023-12-31  103.228427   10.000000  117.341582

[120 rows x 3 columns]

AGREGAR RUIDO:

In [16]:
def add_noise(series, noise_level=0.1):
    noise = np.random.normal(0, noise_level, len(series))
    return series + noise

In [14]:
def df_ruido(df,noise_level=0.1):
    for x in df.columns:
        df[x] = add_noise(df[x],noise_level)
    return df

In [17]:
df_ruido(df,0.4)

                Valor
indice
2014-01-31  62.886928
2014-02-28  61.730235
2014-03-31  62.068131
2014-04-30  61.386790
2014-05-31  59.963889
...               ...
2023-08-31  60.677755
2023-09-30  59.705584
2023-10-31  59.668497
2023-11-30  60.443915
2023-12-31  61.478562

[120 rows x 1 columns]

In [188]:
df_ruido(mult,0.25)

            Altura     Dinero       Peso
indice
2014-01-31     NaN  97.584447  85.978913
2014-02-28     NaN  86.767739  79.477742
2014-03-31     NaN  67.875245  85.161198
2014-04-30     NaN  58.227377  83.079505
2014-05-31     NaN  48.792820  84.404528
...            ...        ...        ...
2023-08-31     NaN   7.338876  82.928543
2023-09-30     NaN   7.381459  85.209277
2023-10-31     NaN   7.052029  84.321807
2023-11-30     NaN   6.401298  84.006133
2023-12-31     NaN   7.220293  82.253993

[120 rows x 3 columns]

ESCALADO

In [19]:
def scale(series,factor):
    return series*factor

In [20]:
def df_scale(df,factor):
    for x in df.columns:
        df[x] = scale(df[x],factor)
    return df

In [21]:
df_scale(df,0.45)

                Valor
indice
2014-01-31  28.299117
2014-02-28  27.778606
2014-03-31  27.930659
2014-04-30  27.624056
2014-05-31  26.983750
...               ...
2023-08-31  27.304990
2023-09-30  26.867513
2023-10-31  26.850824
2023-11-30  27.199762
2023-12-31  27.665353

[120 rows x 1 columns]

In [183]:
df_scale(mult,0.7)

               Altura     Dinero       Peso
indice
2014-01-31  56.478339  97.156595  86.151051
2014-02-28  54.809364  86.663780  79.241386
2014-03-31  56.589746  68.603793  84.825309
2014-04-30  55.755161  58.224646  83.053743
2014-05-31  67.919544  48.634793  84.147756
...               ...        ...        ...
2023-08-31  72.657125   7.036005  82.496740
2023-09-30  71.742143   7.024714  85.493784
2023-10-31  71.440940   7.136102  84.031223
2023-11-30  71.683388   6.781243  83.746984
2023-12-31  72.067411   7.043206  82.227556

[120 rows x 3 columns]

RECORTE

In [22]:
def crop(series, start, end):
    return series[start:end]

In [189]:
def recorte(df, start,end):
    for x in df.columns:
        df[x] = crop(df[x],start,end)
    df=df.dropna()
    return df

In [24]:
recorte(df,15,100)

                Valor
indice
2015-04-30  27.399621
2015-05-31  27.976985
2015-06-30  26.887157
2015-07-31  27.334492
2015-08-31  27.039215
...               ...
2021-12-31  27.476207
2022-01-31  26.878574
2022-02-28  27.575679
2022-03-31  27.540081
2022-04-30  27.290707

[85 rows x 1 columns]

In [191]:
recorte(mult,10,99)

               Altura     Dinero       Peso
indice
2014-11-30  71.323409  18.774763  82.959008
2014-12-31  71.386083  16.634061  82.689217
2015-01-31  72.681124  15.511797  81.224038
2015-02-28  70.779890  13.940262  85.264876
2015-03-31  73.707302  12.372606  83.536062
...               ...        ...        ...
2021-11-30  71.495440   6.713436  82.975673
2021-12-31  73.377671   6.755010  83.059085
2022-01-31  71.701104   6.714391  86.525252
2022-02-28  74.763395   6.689658  84.313268
2022-03-31  72.142744   7.135227  84.030445

[89 rows x 3 columns]

In [196]:
mult

               Altura     Dinero       Peso
indice
2014-11-30  71.323409  18.774763  82.959008
2014-12-31  71.386083  16.634061  82.689217
2015-01-31  72.681124  15.511797  81.224038
2015-02-28  70.779890  13.940262  85.264876
2015-03-31  73.707302  12.372606  83.536062
...               ...        ...        ...
2021-11-30  71.495440   6.713436  82.975673
2021-12-31  73.377671   6.755010  83.059085
2022-01-31  71.701104   6.714391  86.525252
2022-02-28  74.763395   6.689658  84.313268
2022-03-31  72.142744   7.135227  84.030445

[89 rows x 3 columns]

INTERPOLACION:

In [29]:
from scipy.interpolate import interp1d
from scipy.interpolate import UnivariateSpline

In [197]:
def interpolacion(df,kind,num,freq):
    df=df.reset_index()
    indices=df.index.values
    indice=series_periodos(df[df.columns[0]][0],num,freq)
    x =indices 
    for i in range(1,len(df.columns)):
        y = df[df.columns[i]]
        f = interp1d(x, y, kind=kind) #kind='linear' / 'cubic'
        x_new = np.linspace(0, 4, num=num)  # New x values
        y_new = f(x_new)  # Interpolated y values
        if i==1:
            df_int = pd.DataFrame(data=y_new,index=indice,columns=[df.columns[i]])
        else :     
            df_n = pd.DataFrame(data=y_new,index=indice,columns=[df.columns[i]])
            df_int= df_int.join(df_n, how="outer")
    return df_int

In [198]:
interpolacion(df,'linear',500,'M')

                Valor
2014-01-31  50.091752
2014-02-28  50.100278
2014-03-31  50.108805
2014-04-30  50.117332
2014-05-31  50.125859
...               ...
2055-04-30  53.660685
2055-05-31  53.691179
2055-06-30  53.721673
2055-07-31  53.752167
2055-08-31  53.782661

[500 rows x 1 columns]

In [44]:
interpolacion(df,'cubic',140,'M')

                Valor
2014-01-31  53.000000
2014-02-28  53.013821
2014-03-31  53.023910
2014-04-30  53.030379
2014-05-31  53.033338
...               ...
2025-04-30  50.239558
2025-05-31  50.176059
2025-06-30  50.114805
2025-07-31  50.056038
2025-08-31  50.000000

[140 rows x 1 columns]

In [199]:
interpolacion(mult,'linear',190,'M')

               Altura     Dinero       Peso
2014-11-30  71.323409  18.774763  82.959008
2014-12-31  71.324735  18.729457  82.953298
2015-01-31  71.326061  18.684151  82.947588
2015-02-28  71.327388  18.638845  82.941878
2015-03-31  71.328714  18.593540  82.936168
...               ...        ...        ...
2030-04-30  73.459479  12.505318  83.682417
2030-05-31  73.521435  12.472140  83.645828
2030-06-30  73.583391  12.438962  83.609239
2030-07-31  73.645347  12.405784  83.572651
2030-08-31  73.707302  12.372606  83.536062

[190 rows x 3 columns]

In [200]:
interpolacion(mult,'cubic',260,'M')

               Altura     Dinero       Peso
2014-11-30  71.323409  18.774763  82.959008
2014-12-31  71.266946  18.725105  83.028029
2015-01-31  71.213021  18.676104  83.093773
2015-02-28  71.161599  18.627752  83.156285
2015-03-31  71.112645  18.580043  83.215613
...               ...        ...        ...
2036-02-29  73.661005  12.406902  83.733729
2036-03-31  73.677326  12.397045  83.683879
2036-04-30  73.690549  12.388032  83.634285
2036-05-31  73.700575  12.379880  83.584995
2036-06-30  73.707302  12.372606  83.536062

[260 rows x 3 columns]

In [45]:
def interpolate(data):
    interpolated_data = []
    for i in range(len(data) - 1):
        interpolated_data.append(data[i])
        interpolated_data.append((data[i] + data[i + 1]) / 2)  # Punto intermedio
    interpolated_data.append(data[-1])
    return np.array(interpolated_data)

In [172]:
def punto_medio(df,freq):
    for x in df.columns:
        data = df[x]
        a = interpolate(data)
        if x == df.columns[0]:
            indice = series_periodos(df.index[0],len(a),freq)
            df_pm = pd.DataFrame(data=a,index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data=a,index=indice,columns=[x])
            df_pm = df_pm.join(df_new, how="outer")
    return df_pm

In [48]:
punto_medio(df,'M')

            Valor
2014-01-31   53.0
2014-02-28   52.5
2014-03-31   52.0
2014-04-30   51.5
2014-05-31   51.0
...           ...
2033-07-31   50.0
2033-08-31   50.5
2033-09-30   51.0
2033-10-31   51.0
2033-11-30   51.0

[239 rows x 1 columns]

In [201]:
punto_medio(mult,'M')

               Altura     Dinero       Peso
2014-11-30  71.323409  18.774763  82.959008
2014-12-31  71.354746  17.704412  82.824112
2015-01-31  71.386083  16.634061  82.689217
2015-02-28  72.033603  16.072929  81.956628
2015-03-31  72.681124  15.511797  81.224038
...               ...        ...        ...
2029-03-31  71.701104   6.714391  86.525252
2029-04-30  73.232250   6.702024  85.419260
2029-05-31  74.763395   6.689658  84.313268
2029-06-30  73.453070   6.912443  84.171857
2029-07-31  72.142744   7.135227  84.030445

[177 rows x 3 columns]

In [49]:
def spline_interpolation(data, s=1):
    x = np.arange(len(data))
    spline = UnivariateSpline(x, data, s=s)
    return spline(x)

In [50]:
def interpolacion_spline(df,s):
    for x in df.columns:
        df[x]=spline_interpolation(df[x],s)
    return df

In [52]:
interpolacion_spline(df,3)

                Valor
indice
2014-01-31  53.003479
2014-02-28  51.981536
2014-03-31  51.040921
2014-04-30  51.954335
2014-05-31  50.015175
...               ...
2023-08-31  50.775734
2023-09-30  49.982316
2023-10-31  50.186066
2023-11-30  50.858816
2023-12-31  51.035003

[120 rows x 1 columns]

In [202]:
interpolacion_spline(mult,5)

/tmp/ipykernel_185146/2284769947.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x]=spline_interpolation(df[x],s)

               Altura     Dinero       Peso
indice
2014-11-30  71.316332  18.742428  82.964524
2014-12-31  71.425963  16.760245  82.656512
2015-01-31  72.579358  15.349405  81.324696
2015-02-28  70.941511  13.954652  85.077415
2015-03-31  73.519152  12.560122  83.734595
...               ...        ...        ...
2021-11-30  71.652631   6.867049  83.574441
2021-12-31  73.230519   6.728607  82.659450
2022-01-31  71.802870   6.657988  86.655089
2022-02-28  74.720161   6.753882  84.299157
2022-03-31  72.150907   7.114979  84.030312

[89 rows x 3 columns]

RANDOM SAMPLING:

In [203]:
# Randomly sampling with replacement
def sampling(df,size,freq):
    indice=series_periodos(df.index[0],size,freq)
    for x in df.columns:
        data = df[x]
        sampled_data = np.random.choice(data, size=size, replace=True)
        if x == df.columns[0]:
            df_sampling=pd.DataFrame(data=sampled_data,index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data=sampled_data,index=indice,columns=[x])
            df_sampling= df_sampling.join(df_new, how="outer")
    return df_sampling

In [56]:
sampling(df,200,'M')

                Valor
2014-01-31  50.279883
2014-02-28  51.357314
2014-03-31  50.279883
2014-04-30  50.954019
2014-05-31  50.248084
...               ...
2030-04-30  49.894225
2030-05-31  51.942310
2030-06-30  50.521995
2030-07-31  51.003732
2030-08-31  50.127761

[200 rows x 1 columns]

In [204]:
sampling(mult,250,'M')

               Altura     Dinero       Peso
2014-11-30  72.097925   7.514899  81.551955
2014-12-31  72.504343   6.899829  86.023138
2015-01-31  72.688976  11.115808  86.655089
2015-02-28  73.107871   6.867049  82.964524
2015-03-31  73.622814   7.532352  86.857932
...               ...        ...        ...
2035-04-30  73.107871   7.113783  78.959947
2035-05-31  72.097925  12.212358  80.846684
2035-06-30  73.603274   9.219710  83.458099
2035-07-31  71.916701   6.992691  84.314134
2035-08-31  73.519152   6.839368  82.529953

[250 rows x 3 columns]

TRANSFORMACIÓN MATEMÁTICA:

In [207]:
def agregar_log(df):
    for x in df.columns:
        df[x] = np.log1p(df[x])
    return df

In [208]:
def agregar_sqrt(df):
    for x in df.columns:
        df[x] = np.sqrt(df[x])
    return df

In [209]:
def agregar_exp(df,factor):
    for x in df.columns:
        df[x] = np.exp(df[x]/factor)
    return df

In [210]:
def agregar_sin(df):
    for x in df.columns:
        df[x] = np.sin(df[x])
    return df

In [211]:
def agregar_cos(df):
    for x in df.columns:
        df[x] = np.cos(df[x])
    return df

In [212]:
def agregar_trig(df):
    for x in df.columns:
        df[x] = np.cos(df[x]) + np.sin(df[x])
    return df

In [213]:
def agregar_sigmoid(df):
    for x in df.columns:
        df[x] = 1 / (1 + np.exp(-df[x]))
    return df

In [226]:
agregar_log(df)

               Valor
indice
2014-01-31  5.593574
2014-02-28  5.633000
2014-03-31  5.625377
2014-04-30  5.589358
2014-05-31  5.728958
...              ...
2023-08-31  5.651032
2023-09-30  5.619456
2023-10-31  5.618279
2023-11-30  5.644714
2023-12-31  5.623376

[120 rows x 1 columns]

In [244]:
agregar_log(mult)

/tmp/ipykernel_185146/82705003.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = np.log1p(df[x])

              Altura     Dinero       Peso
indice
2014-11-30  3.730414   4.572799  60.892877
2014-12-31  3.739001  18.865388  35.972406
2015-01-31  3.832231  61.113180   3.125951
2015-02-28  3.701411   3.894411  60.263308
2015-03-31  3.912223   3.769523  37.475898
...              ...        ...        ...
2021-11-30  3.756903  37.384859   4.306673
2021-12-31  3.887261  48.878890  37.143786
2022-01-31  3.768881  53.400722   5.879485
2022-02-28  4.019953  46.997403   4.077100
2022-03-31  3.796974  17.423415  60.876646

[89 rows x 3 columns]

In [243]:
agregar_exp(df,2)

               Valor
indice
2014-01-31  1.062330
2014-02-28  1.214540
2014-03-31  1.177930
2014-04-30  1.051092
2014-05-31  1.840568
...              ...
2023-08-31  1.315298
2023-09-30  1.151964
2023-10-31  1.147057
2023-11-30  1.277787
2023-12-31  1.168913

[120 rows x 1 columns]

In [257]:
agregar_exp(mult,3)

/tmp/ipykernel_185146/3704891442.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = np.exp(df[x]/factor)

                Altura      Dinero        Peso
indice
2014-11-30  115.266250  206.559330   81.406303
2014-12-31  125.307640  384.648565   97.937879
2015-01-31  104.967029  384.639110  113.832582
2015-02-28  133.807425  125.946715  384.648730
2015-03-31  133.794372  111.865013  384.648730
...                ...         ...         ...
2021-11-30  128.069374  384.648721   74.611004
2021-12-31  108.531723  384.614964  384.648730
2022-01-31  111.887589  384.645770   72.013142
2022-02-28  128.453048  384.648730   71.981939
2022-03-31  111.160217  384.636562   90.821325

[89 rows x 3 columns]

In [232]:
agregar_cos(df)

               Valor
indice
2014-01-31 -0.775095
2014-02-28 -0.531630
2014-03-31 -0.584385
2014-04-30 -0.796438
2014-05-31  0.258195
...              ...
2023-08-31 -0.397798
2023-09-30 -0.623614
2023-10-31 -0.631220
2023-11-30 -0.446027
2023-12-31 -0.597821

[120 rows x 1 columns]

In [234]:
agregar_cos(mult)

/tmp/ipykernel_185146/3002333217.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = np.cos(df[x])

              Altura    Dinero      Peso
indice
2014-11-30 -0.635134 -0.507354  0.844569
2014-12-31 -0.633517  0.080944  0.346724
2015-01-31 -0.616491  0.925308 -0.777982
2015-02-28 -0.640661 -0.605645  0.796121
2015-03-31 -0.602609 -0.627837  0.367028
...              ...       ...       ...
2021-11-30 -0.630173  0.365801 -0.542182
2021-12-31 -0.606873  0.527197  0.362549
2022-01-31 -0.627956  0.603315 -0.378320
2022-02-28 -0.584866  0.498845 -0.575862
2022-03-31 -0.622818  0.051423  0.842767

[89 rows x 3 columns]

In [235]:
agregar_sin(df)

               Valor
indice
2014-01-31 -0.699784
2014-02-28 -0.506939
2014-03-31 -0.551687
2014-04-30 -0.714870
2014-05-31  0.255335
...              ...
2023-08-31 -0.387389
2023-09-30 -0.583973
2023-10-31 -0.590130
2023-11-30 -0.431384
2023-12-31 -0.562843

[120 rows x 1 columns]

In [237]:
agregar_sin(mult)

/tmp/ipykernel_185146/4139982086.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = np.sin(df[x])

              Altura    Dinero      Peso
indice
2014-11-30 -0.593286 -0.485866  0.747685
2014-12-31 -0.591983  0.080856  0.339819
2015-01-31 -0.578176  0.798806 -0.701843
2015-02-28 -0.597726 -0.569293  0.714648
2015-03-31 -0.566794 -0.587396  0.358843
...              ...       ...       ...
2021-11-30 -0.589284  0.357697 -0.516006
2021-12-31 -0.570301  0.503113  0.354659
2022-01-31 -0.587492  0.567376 -0.369360
2022-02-28 -0.552088  0.478412 -0.544558
2022-03-31 -0.583326  0.051401  0.746487

[89 rows x 3 columns]

In [238]:
agregar_trig(mult)

/tmp/ipykernel_185146/1924027918.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = np.cos(df[x]) + np.sin(df[x])

              Altura    Dinero      Peso
indice
2014-11-30  0.270020  0.417296  1.413208
2014-12-31  0.271828  1.077501  1.276131
2015-01-31  0.290964  1.414086  0.118027
2015-02-28  0.263853  0.303246  1.410676
2015-03-31  0.306697  0.278192  1.287495
...              ...       ...       ...
2021-11-30  0.275572  1.286824  0.376386
2021-12-31  0.301853  1.358241  1.285036
2022-01-31  0.278059  1.380735  0.571540
2022-02-28  0.326965  1.348097  0.337317
2022-03-31  0.283832  1.050057  1.413143

[89 rows x 3 columns]

In [239]:
agregar_trig(df)

               Valor
indice
2014-01-31  0.120929
2014-02-28  0.388731
2014-03-31  0.327517
2014-04-30  0.099659
2014-05-31  1.220149
...              ...
2023-08-31  0.548127
2023-09-30  0.282936
2023-10-31  0.274400
2023-11-30  0.490259
2023-12-31  0.312149

[120 rows x 1 columns]

In [245]:
agregar_sigmoid(df)

               Valor
indice
2014-01-31  0.743136
2014-02-28  0.771101
2014-03-31  0.764575
2014-04-30  0.740985
2014-05-31  0.863016
...              ...
2023-08-31  0.788398
2023-09-30  0.759869
2023-10-31  0.758973
2023-11-30  0.782073
2023-12-31  0.762949

[120 rows x 1 columns]

In [246]:
agregar_sigmoid(mult)

/tmp/ipykernel_185146/1899291068.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = 1 / (1 + np.exp(-df[x]))

              Altura    Dinero      Peso
indice
2014-11-30  0.976579  0.989777  1.000000
2014-12-31  0.976774  1.000000  1.000000
2015-01-31  0.978798  1.000000  0.957951
2015-02-28  0.975906  0.980051  1.000000
2015-03-31  0.980396  0.977457  1.000000
...              ...       ...       ...
2021-11-30  0.977177  1.000000  0.986701
2021-12-31  0.979910  1.000000  1.000000
2022-01-31  0.977443  1.000000  0.997212
2022-02-28  0.982363  1.000000  0.983326
2022-03-31  0.978054  1.000000  1.000000

[89 rows x 3 columns]

In [247]:
agregar_sqrt(df)

               Valor
indice
2014-01-31  0.862053
2014-02-28  0.878124
2014-03-31  0.874400
2014-04-30  0.860805
2014-05-31  0.928986
...              ...
2023-08-31  0.887918
2023-09-30  0.871705
2023-10-31  0.871191
2023-11-30  0.884349
2023-12-31  0.873469

[120 rows x 1 columns]

In [248]:
agregar_sqrt(mult)

/tmp/ipykernel_185146/241470103.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = np.sqrt(df[x])

              Altura    Dinero      Peso
indice
2014-11-30  0.988220  0.994875  1.000000
2014-12-31  0.988319  1.000000  1.000000
2015-01-31  0.989342  1.000000  0.978750
2015-02-28  0.987880  0.989975  1.000000
2015-03-31  0.990149  0.988664  1.000000
...              ...       ...       ...
2021-11-30  0.988523  1.000000  0.993328
2021-12-31  0.989904  1.000000  1.000000
2022-01-31  0.988657  1.000000  0.998605
2022-02-28  0.991142  1.000000  0.991628
2022-03-31  0.988966  1.000000  1.000000

[89 rows x 3 columns]

MIXUP

In [66]:
def mixup(data, alpha=0.2):
    lambda_ = np.random.beta(alpha, alpha)
    indices = np.random.permutation(len(data))
    data_mixup = lambda_ * data + (1 - lambda_) * data[indices]
    return data_mixup

In [64]:
def agregar_mixup(df,alpha=0.2):
    for x in df.columns:
        df[x] = mixup(df[x].values,alpha)
    return df

In [67]:
agregar_mixup(df)

                Valor
indice
2014-01-31  49.866847
2014-02-28  51.982777
2014-03-31  51.035182
2014-04-30  50.330684
2014-05-31  51.316595
...               ...
2023-08-31  50.967774
2023-09-30  51.008804
2023-10-31  50.015476
2023-11-30  50.829132
2023-12-31  51.063529

[120 rows x 1 columns]

In [258]:
agregar_mixup(mult)

/tmp/ipykernel_185146/3085879628.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = mixup(df[x].values,alpha)

                Altura      Dinero        Peso
indice
2014-11-30  124.900812  302.923326   85.112971
2014-12-31  109.021344  384.648654   97.850436
2015-01-31  118.849087  384.644315  117.142889
2015-02-28  101.364355  265.930205  384.648730
2015-03-31  114.705037  259.273625  380.556003
...                ...         ...         ...
2021-11-30  105.799825  190.271131   74.510014
2021-12-31  112.426097  384.600267  384.648730
2022-01-31  122.650456  384.643150   75.559196
2022-02-28  102.301753  384.648641   71.987298
2022-03-31  111.288084  384.643142   90.770691

[89 rows x 3 columns]

In [70]:
def random_mix(data, n_samples=100):
    mixed_data = []
    for _ in range(n_samples):
        i, j = np.random.choice(len(data), 2, replace=False)
        mixed_data.append((data[i] + data[j]) / 2)
    return np.array(mixed_data)

In [69]:
def agregar_random_mix(df,freq,n_samples):
    indice=series_periodos(df.index[0],n_samples,freq)
    for x in df.columns:
        sampled_data = random_mix(df[x],n_samples)
        if x == df.columns[0]:
            df_sampling=pd.DataFrame(data=sampled_data,index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data=sampled_data,index=indice,columns=[x])
            df_sampling= df_sampling.join(df_new, how="outer")
    return df_sampling

In [71]:
agregar_random_mix(df,'M',380)

                Valor
2014-01-31  50.243961
2014-02-28  50.098233
2014-03-31  50.454804
2014-04-30  49.980509
2014-05-31  50.447474
...               ...
2045-04-30  50.552895
2045-05-31  51.868280
2045-06-30  51.436472
2045-07-31  50.691769
2045-08-31  50.571496

[380 rows x 1 columns]

In [259]:
agregar_random_mix(mult,'M',200)

                Altura      Dinero        Peso
2014-11-30  126.198094  303.462075  201.614995
2014-12-31  112.623385  142.909249  151.210996
2015-01-31  116.264077  384.642822  214.153096
2015-02-28  117.439648  384.648730  104.799580
2015-03-31  122.673793  336.449932  276.737960
...                ...         ...         ...
2031-02-28  109.628881  382.979012  230.230444
2031-03-31  119.332725  313.850374   89.261807
2031-04-30  104.203246  288.931774  197.398357
2031-05-31  117.741742  306.703666   93.647489
2031-06-30  110.996284  313.849462  237.484905

[200 rows x 3 columns]

VENTANAS DESLIZANTES:

In [81]:
def ventanas(df,ventana):
    for x in df.columns:
        df[x] = df[x].rolling(window=ventana).mean()
        df = df.dropna()
        return df

In [82]:
ventanas(df,4)

                Valor
indice
2015-07-31  50.935691
2015-08-31  51.032347
2015-09-30  51.087081
2015-10-31  51.087410
2015-11-30  51.046871
...               ...
2023-08-31  50.916587
2023-09-30  50.951200
2023-10-31  50.934732
2023-11-30  50.878229
2023-12-31  50.804100

[102 rows x 1 columns]

In [261]:
ventanas(mult,3)

/tmp/ipykernel_185146/3145810756.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[x] = df[x].rolling(window=ventana).mean()

                Altura      Dinero        Peso
indice
2015-01-31  117.590414  384.644315  117.142889
2015-02-28  109.744928  265.930205  384.648730
2015-03-31  111.639493  259.273625  380.556003
2015-04-30  109.778479  381.833450   78.685723
2015-05-31  113.640459  384.599338  384.648730
...                ...         ...         ...
2021-11-30  111.811738  190.271131   74.510014
2021-12-31  109.170586  384.600267  384.648730
2022-01-31  113.625459  384.643150   75.559196
2022-02-28  112.459435  384.648641   71.987298
2022-03-31  112.080098  384.643142   90.770691

[87 rows x 3 columns]

PCA:

In [ ]:
from sklearn.decomposition import PCA

data_multidim = np.array([[1.2, 3.4], [5.6, 7.8], [9.1, 2.2]])
pca = PCA(n_components=2)
data_pca = pca.fit_transform(data_multidim)
data_pca_jittered = data_pca + np.random.normal(0, 0.1, data_pca.shape)
data_augmented = pca.inverse_transform(data_pca_jittered)

USO DE TECNICAS ESTADÍSTICAS:

In [100]:
def normal(df,freq,size):
    indice=series_periodos(df.index[0],size+df.shape[0],freq)
    for x in df.columns:
        data = df[x]
        mean,std_dev = np.mean(data),np.std(data)
        data_augmented = np.random.normal(mean,std_dev,size=size)
        if x == df.columns[0]:
            df_normal=pd.DataFrame(data=np.concatenate((df[x].values,data_augmented)),index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data=np.concatenate((data,data_augmented)),index=indice,columns=[x])
            df_normal= df_normal.join(df_new, how="outer")
    return df_normal

In [101]:
normal(df,'M',300)

                Valor
2014-01-31  53.000000
2014-02-28  52.000000
2014-03-31  51.000000
2014-04-30  52.000000
2014-05-31  50.000000
...               ...
2048-08-31  51.259481
2048-09-30  50.391287
2048-10-31  50.858691
2048-11-30  51.570037
2048-12-31  51.641644

[420 rows x 1 columns]

In [262]:
normal(mult,'M',150)

                Altura      Dinero        Peso
2014-11-30         NaN  302.923326   85.112971
2014-12-31         NaN  384.648654   97.850436
2015-01-31  117.590414  384.644315  117.142889
2015-02-28  109.744928  265.930205  384.648730
2015-03-31  111.639493  259.273625  380.556003
...                ...         ...         ...
2034-05-31  110.230993  182.298925  179.554464
2034-06-30  112.960166  351.739716   66.368025
2034-07-31  124.794992  401.765069  152.393923
2034-08-31  106.885150  425.951037  262.526271
2034-09-30  123.120930  304.981774  193.551417

[239 rows x 3 columns]

In [264]:
def log_normal(df,freq,sigma,size):
    indice=series_periodos(df.index[0],size+df.shape[0],freq)
    for x in df.columns:
        data = df[x].values
        data_augmented = np.random.lognormal(mean=np.log(data.mean()),sigma=sigma,size=size)
        if x == df.columns[0]:
            df_lognormal=pd.DataFrame(data=np.concatenate((df[x].values,data_augmented)),index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data=np.concatenate((data,data_augmented)),index=indice,columns=[x])
            df_lognormal= df_lognormal.join(df_new, how="outer")
    return df_lognormal

In [106]:
log_normal(df,'M',0.5,200)

                 Valor
2014-01-31   53.000000
2014-02-28   52.000000
2014-03-31   51.000000
2014-04-30   52.000000
2014-05-31   50.000000
...                ...
2040-04-30   55.813829
2040-05-31   67.479704
2040-06-30  145.628254
2040-07-31   88.872659
2040-08-31   60.998058

[320 rows x 1 columns]

In [266]:
log_normal(mult,'M',0.1,49)

                Altura      Dinero        Peso
2014-01-31   70.555312  129.091399  112.902687
2014-02-28   68.346558  113.850549  102.844928
2014-03-31   70.871320   87.866499  111.120237
2014-04-30   69.665688   73.274410  108.697997
2014-05-31   87.544611   59.460597  110.748102
...                ...         ...         ...
2027-09-30   95.631211    6.349266   98.439662
2027-10-31   94.603226    5.409678   97.379264
2027-11-30   77.882364    6.760211  127.014320
2027-12-31   81.154451    5.675756   97.369650
2028-01-31  100.964495    6.326642  109.117193

[169 rows x 3 columns]

In [110]:
def box_muller_transform(mean, std_dev, size=100):
    u1, u2 = np.random.rand(size), np.random.rand(size)
    z1 = np.sqrt(-2 * np.log(u1)) * np.cos(2 * np.pi * u2)
    return mean + z1 * std_dev

def box_muller(df,freq,size):
    indice=series_periodos(df.index[0],size+df.shape[0],freq)
    for x in df.columns:
        data = df[x].values
        data_bm = box_muller_transform(data.mean(),data.std(),size)
        if x == df.columns[0]:
            df_bm=pd.DataFrame(data=np.concatenate((df[x].values,data_bm)),index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data=np.concatenate((df[x].values,data_bm)),index=indice,columns=[x])
            df_bm = df_bm.join(df_new, how="outer")
    return df_bm

In [111]:
box_muller(df,'M',300)

                Valor
2014-01-31  53.000000
2014-02-28  52.000000
2014-03-31  51.000000
2014-04-30  52.000000
2014-05-31  50.000000
...               ...
2048-08-31  51.138977
2048-09-30  51.547536
2048-10-31  51.450927
2048-11-30  49.517649
2048-12-31  50.618625

[420 rows x 1 columns]

In [267]:
box_muller(mult,'M',150)

               Altura      Dinero        Peso
2014-01-31  70.555312  129.091399  112.902687
2014-02-28  68.346558  113.850549  102.844928
2014-03-31  70.871320   87.866499  111.120237
2014-04-30  69.665688   73.274410  108.697997
2014-05-31  87.544611   59.460597  110.748102
...               ...         ...         ...
2036-02-29  88.630123  -20.575621  110.087236
2036-03-31  91.374526   16.311430  104.707342
2036-04-30  92.199401   16.655067  106.322211
2036-05-31  85.418397   43.574238  104.403242
2036-06-30  91.515441   -5.145644  112.090863

[270 rows x 3 columns]

DESPLAZAMIENTO EN BLOQUES:

In [118]:
def despl_bloque(df,block_size):
    for x in df.columns:
        data = df[x].values
        shifted_data = []
        for i in range(0,len(data),block_size):
            block = data[i:i+block_size]
            shifted_block = np.roll(block, np.random.randint(1, block_size))
            shifted_data.extend(shifted_block)
        df[x] = np.array(shifted_data)
    return df

In [119]:
despl_bloque(df,5)

            Valor
indice
2014-01-31     52
2014-02-28     51
2014-03-31     52
2014-04-30     50
2014-05-31     53
...           ...
2023-08-31     50
2023-09-30     50
2023-10-31     51
2023-11-30     51
2023-12-31     51

[120 rows x 1 columns]

In [271]:
despl_bloque(mult,5)

               Altura        Dinero        Peso
indice
2014-01-31  87.649072  8.786650e+01  112.902687
2014-02-28  70.555312  4.245469e+01  110.748102
2014-03-31  68.346558  3.029097e+01  110.117909
2014-04-30  85.301183  1.290914e+02  110.313671
2014-05-31  89.291936  1.138505e+02  113.851411
...               ...           ...         ...
2023-08-31  92.320897  2.587487e-08  108.796229
2023-09-30  92.210241  2.109014e-08  108.131639
2023-10-31  93.631116  9.395022e-09  112.406146
2023-11-30  92.122000  7.631569e-09  109.946900
2023-12-31  91.822198  6.235040e-09  111.019207

[120 rows x 3 columns]

ROTACIÓN:

In [272]:
def rotacion(df):
    for x in df.columns:
        data = df[x].values
        rotation_steps = np.random.randint(1, len(data))
        df[x]= np.roll(data, rotation_steps)
    return df

In [273]:
rotacion(df)

               Valor
indice
2014-01-31  0.882552
2014-02-28  0.877149
2014-03-31  0.863107
2014-04-30  0.898681
2014-05-31  0.878027
...              ...
2023-08-31  0.921802
2023-09-30  0.880473
2023-10-31  0.888685
2023-11-30  0.861855
2023-12-31  0.886749

[120 rows x 1 columns]

In [274]:
rotacion(mult)

               Altura    Dinero        Peso
indice
2014-01-31  95.695246  0.003250  113.851411
2014-02-28  93.768123  0.002826  109.770028
2014-03-31  94.252433  0.002358  106.126588
2014-04-30  94.658064  0.000415  108.402409
2014-05-31  93.434111  0.001735  110.748102
...               ...       ...         ...
2023-08-31  92.776230  0.025909  109.452335
2023-09-30  93.651321  0.020056  107.341582
2023-10-31  92.443198  0.017218  110.654613
2023-11-30  91.987590  0.008339  107.927525
2023-12-31  95.215949  0.003935  110.313671

[120 rows x 3 columns]

RUIDO ARMONICO

In [275]:
def add_harmonic_noise(df, amplitude=0.1, frequency=0.5):
    for x in df.columns:
        data = df[x].values
        time = np.arange(len(data))
        harmonic_noise = amplitude * np.sin(2 * np.pi * frequency * time)
        df[x] = data + harmonic_noise
    return df

In [276]:
add_harmonic_noise(df,1000,0.5)

               Valor
indice
2014-01-31  0.882552
2014-02-28  0.877149
2014-03-31  0.863107
2014-04-30  0.898681
2014-05-31  0.878027
...              ...
2023-08-31  0.921802
2023-09-30  0.880473
2023-10-31  0.888685
2023-11-30  0.861855
2023-12-31  0.886749

[120 rows x 1 columns]

In [277]:
add_harmonic_noise(mult,1,0.5)

               Altura    Dinero        Peso
indice
2014-01-31  95.695246  0.003250  113.851411
2014-02-28  93.768123  0.002826  109.770028
2014-03-31  94.252433  0.002358  106.126588
2014-04-30  94.658064  0.000415  108.402409
2014-05-31  93.434111  0.001735  110.748102
...               ...       ...         ...
2023-08-31  92.776230  0.025909  109.452335
2023-09-30  93.651321  0.020056  107.341582
2023-10-31  92.443198  0.017218  110.654613
2023-11-30  91.987590  0.008339  107.927525
2023-12-31  95.215949  0.003935  110.313671

[120 rows x 3 columns]

BOOTSTRAPPING:

In [280]:
def agregar_bootstrapping(df,freq):
    # Suponiendo  que df es tu DataFrame con series temporales originales
    
    for x in df.columns:
        synthetic_data = df.sample(frac=1, replace=True).reset_index(drop=True)
        synthetic_data[x] += np.random.normal(0, 0.1, len(synthetic_data))  # Añadir ruido
        indice=series_periodos(df.index[0],len(df)+len(synthetic_data),freq)
        a=pd.concat([df[x],synthetic_data[x]])
        a.index=indice
        if x == df.columns[0]:
            df_bootstrap=pd.DataFrame(data=a)
        else:
            df_bootstrap= df_bootstrap.join(a, how="outer")
    return df_bootstrap

In [281]:
agregar_bootstrapping(df,'M')

               Valor
2014-01-31  0.882552
2014-02-28  0.877149
2014-03-31  0.863107
2014-04-30  0.898681
2014-05-31  0.878027
...              ...
2033-08-31  1.139601
2033-09-30  0.864164
2033-10-31  0.910041
2033-11-30  0.790224
2033-12-31  0.903607

[240 rows x 1 columns]

In [282]:
agregar_bootstrapping(mult,'M')

               Altura    Dinero        Peso
2014-01-31  95.695246  0.003250  113.851411
2014-02-28  93.768123  0.002826  109.770028
2014-03-31  94.252433  0.002358  106.126588
2014-04-30  94.658064  0.000415  108.402409
2014-05-31  93.434111  0.001735  110.748102
...               ...       ...         ...
2033-08-31  92.756148  0.040481  110.471317
2033-09-30  92.142619 -0.078555  113.931481
2033-10-31  97.127067  2.566986  110.776084
2033-11-30  92.640655  0.338120  107.525165
2033-12-31  93.270466  3.093551  112.499300

[240 rows x 3 columns]

PERTURBACIÓN GAUSSIANA:

In [138]:
def cumulative_gaussian_perturbation(data, std_dev=0.05):
    perturbations = np.random.normal(0, std_dev, len(data))
    cumulative_data = np.cumsum(perturbations) + data
    return cumulative_data

In [136]:
def agregacion_gauss(df,std_dev=0.05):
    for x in df.columns:
        df[x] = cumulative_gaussian_perturbation(df[x],std_dev)
    return df

In [139]:
agregacion_gauss(df,0.1)

                Valor
indice
2014-01-31  50.077089
2014-02-28  51.140813
2014-03-31  49.945779
2014-04-30  49.963889
2014-05-31  52.941948
...               ...
2023-08-31  51.655694
2023-09-30  50.799683
2023-10-31  50.767895
2023-11-30  51.840945
2023-12-31  50.905629

[120 rows x 1 columns]

In [284]:
agregacion_gauss(mult)

               Altura    Dinero        Peso
indice
2014-01-31  95.627103  0.042458  113.874215
2014-02-28  93.705276  0.071140  109.874897
2014-03-31  94.235798  0.096878  106.285429
2014-04-30  94.606915  0.067268  108.607852
2014-05-31  93.430994  0.101736  110.996108
...               ...       ...         ...
2023-08-31  92.866929 -0.473574  109.491008
2023-09-30  93.726572 -0.468314  107.384282
2023-10-31  92.541358 -0.495388  110.668362
2023-11-30  92.046472 -0.479139  107.944782
2023-12-31  95.332584 -0.559444  110.291092

[120 rows x 3 columns]

TRANSFORMACIÓN WAVELET:

In [142]:
def wavelet_transform_augmentation(data, wavelet='db1'):
    coeffs = pywt.wavedec(data, wavelet)
    coeffs[0] += np.random.normal(0, 0.1, len(coeffs[0]))  # Añadir ruido al coeficiente principal
    augmented_data = pywt.waverec(coeffs, wavelet)
    return augmented_data[:len(data)]  # Para mantener el tamaño original

In [141]:
def agregar_wavelet(df,wavelet='db1'):
    for x in df.columns:
        data = df[x].values
        df[x]=wavelet_transform_augmentation(data,wavelet)
    return df

In [143]:
agregar_wavelet(df)

                Valor
indice
2014-01-31  50.091752
2014-02-28  51.155476
2014-03-31  49.960442
2014-04-30  49.978552
2014-05-31  52.956611
...               ...
2023-08-31  51.645029
2023-09-30  50.789018
2023-10-31  50.757230
2023-11-30  51.830280
2023-12-31  50.894964

[120 rows x 1 columns]

In [285]:
agregar_wavelet(mult)

               Altura    Dinero        Peso
indice
2014-01-31  95.624586  0.045938  113.864311
2014-02-28  93.702759  0.074620  109.864994
2014-03-31  94.233280  0.100358  106.275525
2014-04-30  94.604398  0.070748  108.597948
2014-05-31  93.428476  0.105216  110.986205
...               ...       ...         ...
2023-08-31  92.895229 -0.456264  109.512345
2023-09-30  93.754872 -0.451004  107.405619
2023-10-31  92.569658 -0.478078  110.689699
2023-11-30  92.074772 -0.461829  107.966119
2023-12-31  95.360884 -0.542135  110.312429

[120 rows x 3 columns]

DUPLICADO + PERTURBACIÓN:

In [288]:
def duplicate_and_perturb(data, duplication_factor=0.3, perturbation_std=0.05):
    duplicated_data = []
    np.random.seed(8)
    for point in data:
        duplicated_data.append(point)
        if np.random.rand() < duplication_factor:
            duplicated_data.append(point + np.random.normal(0, perturbation_std))
    return np.array(duplicated_data)

In [145]:
def duplicados(df,freq,duplication_factor=0.3,perturbation_std=0.05):
    
    for x in df.columns:
        data = df[x]
        data_dd=duplicate_and_perturb(data,duplication_factor,perturbation_std)
        if x == df.columns[0]:
            indice = series_periodos(df.index[0],len(data_dd),freq)
            df_dd = pd.DataFrame(data=data_dd,index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data = data_dd,index=indice,columns=[x])
            df_dd = df_dd.join(df_new, how="outer")
            
    return df_dd

In [289]:
duplicados(df,'M')

               Valor
2014-01-31  0.882552
2014-02-28  0.877149
2014-03-31  0.863107
2014-04-30  0.898681
2014-05-31  0.878027
...              ...
2026-05-31  0.841354
2026-06-30  0.888685
2026-07-31  0.768925
2026-08-31  0.861855
2026-09-30  0.886749

[153 rows x 1 columns]

In [290]:
duplicados(mult,'M')

               Altura    Dinero        Peso
2014-01-31  95.624586  0.045938  113.864311
2014-02-28  93.702759  0.074620  109.864994
2014-03-31  94.233280  0.100358  106.275525
2014-04-30  94.604398  0.070748  108.597948
2014-05-31  93.428476  0.105216  110.986205
...               ...       ...         ...
2026-05-31  93.715753 -0.490123  107.366501
2026-06-30  92.569658 -0.478078  110.689699
2026-07-31  92.449897 -0.597839  110.569938
2026-08-31  92.074772 -0.461829  107.966119
2026-09-30  95.360884 -0.542135  110.312429

[153 rows x 3 columns]

SIMULACIÓN DE SALTOS:

In [291]:
def pulse_noise(data, num_pulses=5, amplitude=1):
    pulse_indices = np.random.choice(len(data), num_pulses, replace=False)
    pulse_data = data.copy()
    for i in pulse_indices:
        pulse_data[i] += np.random.uniform(-amplitude, amplitude)
    return pulse_data

In [292]:
def agregar_saltos(df,num_pulses,amplitude=1):
    for x in df.columns:
        data = df [x]
        data_salto=pulse_noise(data,num_pulses,amplitude)
        df[x]= data_salto
    return df

In [297]:
agregar_saltos(df,30)

               Valor
indice
2014-01-31  1.644349
2014-02-28  0.877149
2014-03-31  0.606358
2014-04-30  0.679931
2014-05-31  0.878027
...              ...
2023-08-31  1.591588
2023-09-30  0.234513
2023-10-31  0.879943
2023-11-30  0.005608
2023-12-31 -0.166447

[120 rows x 1 columns]

In [299]:
agregar_saltos(mult,20)

               Altura    Dinero        Peso
indice
2014-01-31  95.624586  0.045938  113.864311
2014-02-28  93.702759  0.074620  109.864994
2014-03-31  94.233280 -0.024744  105.521389
2014-04-30  94.790302  0.070748  108.597948
2014-05-31  93.428476  0.105216  110.986205
...               ...       ...         ...
2023-08-31  92.895229 -0.456264  109.512345
2023-09-30  93.754872 -0.451004  107.405619
2023-10-31  92.569658 -0.478078  111.205650
2023-11-30  92.793205 -0.461829  107.966119
2023-12-31  95.360884 -0.542135  110.312429

[120 rows x 3 columns]

COMBINACIÓN LINEAL:

In [156]:
def linear_combinations(data, n_combinations):
    combinations = []
    for _ in range(n_combinations):
        weights = np.random.rand(data.shape[0])
        weights /= np.sum(weights)  # Normalizar pesos
        combination = np.dot(weights, data)
        combinations.append(combination)
    return np.array(combinations)

In [158]:
def agregar_comb(df,freq,size):
    for x in df.columns:
        data = df[x]
        data_augmented = linear_combinations(data,size)
        datos=np.concatenate((data.values,data_augmented))
        if x == df.columns[0]:
            indice = series_periodos(df.index[0],len(datos),freq)
            df_dl = pd.DataFrame(data=datos,index=indice,columns=[x])
        else:
            df_new = pd.DataFrame(data = datos,index=indice,columns=[x])
            df_dl = df_dl.join(df_new, how="outer")
    return df_dl

In [159]:
agregar_comb(df,'M',1000)

                Valor
2014-01-31  50.091752
2014-02-28  51.155476
2014-03-31  50.949094
2014-04-30  49.978552
2014-05-31  53.782661
...               ...
2106-12-31  50.946805
2107-01-31  51.088001
2107-02-28  51.026965
2107-03-31  50.939780
2107-04-30  50.996267

[1120 rows x 1 columns]

In [300]:
agregar_comb(mult,'M',200)

               Altura    Dinero        Peso
2014-01-31  95.624586  0.045938  113.864311
2014-02-28  93.702759  0.074620  109.864994
2014-03-31  94.233280 -0.024744  105.521389
2014-04-30  94.790302  0.070748  108.597948
2014-05-31  93.428476  0.105216  110.986205
...               ...       ...         ...
2040-04-30  92.193817  6.547274  109.720310
2040-05-31  92.361816  6.136482  109.800487
2040-06-30  92.224896  5.619871  109.423311
2040-07-31  92.353069  4.225802  109.763760
2040-08-31  92.064431  4.797151  109.567090

[320 rows x 3 columns]